FONT RO
GAP  Errors
LAB  PArm OFF
TIME OFF
LAB  OT  Cen X-3 Pulse Profile
LAB  T   Spline Fit and Residuals
LAB  Y   Rate (ct/sec)
MOD  @fig03
! Move the main window to a nice place
LOC  0 .30 1 1
LAB  NX OFF
VIEW .15 0 .85 .85
! Create the second window
WIN  2
LOC  0 0 1 .30
VIEW .15 .40 .85 1.0
DG   2   residuals
YPL  2
LAB  G2  Residuals
LAB  X   Pulse Phase
WIN  ALL
R    X   0 1
