#define	SIN20	0.3420201433256687
#define	COS20	0.9396926207859084

/**********************************************************/
/*	ＳＳＡＳ係数					  */
/**********************************************************/
static	double	bodyn_to_ssas[2][3][3]	/*  SSAS座標変換行列  */
	= { { { -1.0e0,  0.0e0,  0.0e0 },
	      {  0.0e0,  0.0e0,  1.0e0 },
	      {  0.0e0,  1.0e0,  0.0e0 } },
	    { { -1.0e0,  0.0e0,  0.0e0 },
	      {  0.0e0,  COS20,  SIN20 },
	      {  0.0e0,  SIN20, -COS20 } } };

/**********************************************************/
/*	ＮＳＡＳ係数					  */
/**********************************************************/
static	double	nsas_xc = 1022.7e0;	/*　Ｘバイアス　*/
static	double	nsas_yc = 1024.3e0;	/*　Ｙバイアス　*/
static	double	nsas_l = 0.014e0;	/*　ＣＣＤ画素長　*/
static	double	nsas_h[4]	= { 18.30e0, 2.0e0, 0.71e0, 1.214e0 };
					/*　プリズムの厚さ　*/
static	double	nsas_n[4]	= { 1.46088e0, 1.578e0, 1.522e0, 1.0e0 };
					/*　屈折率　*/
static	double	nsas_eps = 2.0e-7;	/*　繰り返し収束判定値[rad]　*/


/**********************************************************/
/*	ＳＴＴ係数					  */
/**********************************************************/
static	double STT_h0[2] = { 517.0e0, 495.0e0 };
					/*　Hオフセット　*/
static	double STT_v0[2] = { 253.0e0, 245.0e0 };
					/*　Vオフセット　*/
/******************************************/
/*static	double STT_f[2] = { 5801.7e0, 5792.5e0 };*/
/*static	double STT_f[2] = { 5792.5e0, 5802.5e0 }; 93/3/15 */
/******************************************/
static	double STT_f[2] = { 5789.167e0, 5797.917e0 };
					/*　焦点距離／画素長　*/
static	double STT_delta1[2] = { 0.0e0, 0.0e0 };
					/*　CCD取り付け誤差補正係数δ1　*/
static	double STT_delta2[2] = { 0.0e0, 0.0e0 };
					/*　CCD取り付け誤差補正係数δ2　*/
static	double STT_gamma1[2] = { 0.0e0, 0.0e0 };
					/*　ﾚﾝｽﾞﾃﾞｨｽﾄｰｼｮﾝ補正係数γ1　*/
static	double STT_gamma2[2] = { 0.0e0, 0.0e0 };
					/*　ﾚﾝｽﾞﾃﾞｨｽﾄｰｼｮﾝ補正係数γ2　*/
